{
  "updated": "May 11, 2018 @  6:09 PM",
  "source": "https://docs.google.com/spreadsheets/d/e/2PACX-1vR_ggYGhA2KS7Vyo30ImCIIkRK6omm7dD0tiyeR1ytpg2EUpiMRyIT1QniX6vujm3DnV3eRj5pW6-TX/pubhtml",
  "data": [
    {
      "name": "Adept",
      "hit_die": "1d6",
      "hit_points": "6 + your Constitution modifier",
      "increase_hit_points": "1d6 (or 4) + your Constitution modifier",
      "weapon": "Heavy Pistols and choose one from Melee and SMGs",
      "armor_proficiency": "Light",
      "saving_throw": "Wisdom, Charisma",
      "skill": "Choose three from Acrobatics, Deception, History, Insight, Intimidation, Performance, Sleight of Hand, and Survival",
      "primary_ability": "Wisdom",
      "spellcasting": "Adepts have an L5x biotic implant which requires conscious control over their nervous system. As an Adept, you use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a biotic spell you cast and when making an attack roll with one.",
      "d_d_similarities": "Wizard",
      "description": "Adepts are biotic specialists, capable of disabling and killing enemies with raw biotic power. While they lack advanced combat training, they are the best at defeating enemies without firing a shot. They are outfitted with L5x implants that can spawn a micro-singularity, damaging enemies and pulling them into the air.",
      "snippet": "The Adept is the ultimate biotic, able to affect the physical world with the power of the mind. ",
      "starting_equipment": [
        {
          "id": 1,
          "type": "list",
          "data": [
            "M-3 Predator or M-4 Shuriken",
            "Omni-blade or Monomolecular blade",
            "Stock Light Armor"
          ]
        }
      ],
      "id": "adept",
      "starting_equipment_text_dump": "listM3PredatororM4ShurikenOmnibladeorMonomolecularbladeStockLightArmorlist"
    },
    {
      "name": "Engineer",
      "hit_die": "1d8",
      "hit_points": "8 + your Constitution modifier",
      "increase_hit_points": "1d8 (or 5) + your Constitution modifier",
      "weapon": "Heavy Pistols and choose one from Assault Rifles, Melee, and SMGs",
      "armor_proficiency": "Light, Medium",
      "saving_throw": "Intelligence, Constitution",
      "skill": "Choose three skills from Athletics, Electronics, Engineering, History, Investigation, Medicine, Science, and Vehicle Handling",
      "primary_ability": "Intelligence",
      "spellcasting": "Engineers use a highly modified Omni-tool that requires a keen intellect to maintain. As an Engineer, you use your Intelligence whenever a spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for a tech spell you cast and when making an attack roll with one.",
      "d_d_similarities": "Monk",
      "description": "The Engineer is a tech specialist, able to quickly and easily manipulate the environment with specific talents, and repair or modify technical equipment. Gameplay focus is on shaping the battlefield during combat, healing the party, and debuffing enemies (disabling weapons and lowering shields).",
      "snippet": "Engineers are tech specialists, the only class able to employ combat drones on the battlefield.",
      "starting_equipment": [
        {
          "id": 1,
          "type": "list",
          "data": [
            "M-3 Predator, M-4 Shuriken, or M-8 Avenger",
            "Omni-Taser, Omni-Blade, or Omni-Torch",
            "Stock Light Armor or Stock Medium Armor"
          ]
        }
      ],
      "id": "engineer",
      "starting_equipment_text_dump": "listM3PredatorM4ShurikenorM8AvengerOmniTaserOmniBladeorOmniTorchStockLightArmororStockMediumArmorlist"
    },
    {
      "name": "Infiltrator",
      "hit_die": "1d8",
      "hit_points": "8 + your Constitution modifier",
      "increase_hit_points": "1d8 (or 5) + your Constitution modifier",
      "weapon": "Heavy Pistols and choose two from Assault Rifles, Melee, SMGs, and Sniper Rifles",
      "armor_proficiency": "Light",
      "saving_throw": "Intelligence, Dexterity",
      "skill": "Choose three from Athletics, Acrobatics, Deception, Electronics, History, Insight, Investigation, Perception, Persuasion, Sleight of Hand, Stealth, and Vehicle Handling",
      "primary_ability": "Dexterity",
      "spellcasting": "Infiltrators use a highly modified Omni-tool that requires a keen intellect to maintain. As an Infiltrator, you use your Intelligence whenever a spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for a tech spell you cast and when making an attack roll with one.",
      "d_d_similarities": "Rogue",
      "description": "The Infiltrator is a tech-savvy warrior, able to win battles by quickly disabling and killing enemies. These soldiers focus on unlocking alternate routes, gaining access to good equipment, and obtaining an advantageous position over enemies in combat. ",
      "snippet": "Infiltrators are tech and combat specialists with the unique ability to cloak themselves.",
      "starting_equipment": [
        {
          "id": 1,
          "type": "list",
          "data": [
            "M-3 Predator, M-4 Shuriken, or M-92 Mantis",
            "Omni-Taser, Omni-Blade, or Monomolecular Blade",
            "Stock Light Armor"
          ]
        }
      ],
      "id": "infiltrator",
      "starting_equipment_text_dump": "listM3PredatorM4ShurikenorM92MantisOmniTaserOmniBladeorMonomolecularBladeStockLightArmorlist"
    },
    {
      "name": "Sentinel",
      "hit_die": "1d10",
      "hit_points": "10 + your Constitution modifier",
      "increase_hit_points": "1d10 (or 6) + your Constitution modifier",
      "weapon": "Heavy Pistols, choose two from Assault Rifles, Melee, Shotguns, and SMGs",
      "armor_proficiency": "Light, Medium, Heavy",
      "saving_throw": "Constitution, Charisma",
      "skill": "Choose three from Athletics, Engineering, Insight, Intimidation, Medicine, Persuasion, Science, and Survival",
      "primary_ability": "Wisdom or Intelligence",
      "spellcasting": "Sentinels use the L5q biotic implant and a modified Omni-tool. When casting Biotic spells, Wisdom is your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a biotic spell you cast and when making an attack roll with one. When casting Tech powers, Intelligence is your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for a tech spell you cast and when making an attack roll with one.",
      "d_d_similarities": "Paladin",
      "description": "The Sentinel is able to combine tech and biotics to manipulate the environment, disable and track enemies, or defend the party. In addition to complete weapons training, Sentinels are equipped with an advanced shield that makes taking cover much less necessary and rushing their enemies much more productive. Because Sentinels have access to both biotic spells and tech powers, they have two Spellcasting Skills, Spell Attack Modifiers, and Spell Save DCs. Intelligence is the skill used for all tech powers, and Wisdom is used as the skill for all biotic powers.",
      "snippet": "Sentinels are unique, bringing both tech and biotic abilities to the battlefield.",
      "starting_equipment": [
        {
          "id": 1,
          "type": "list",
          "data": [
            "M-3 Predator, M-4 Shuriken, or M-8 Avenger",
            "Omni-Blade, Omni-Hammer, Monomolecular Blade, or Riot Shield",
            "Stock Light Armor, Stock Medium Armor, or Stock Heavy Armor"
          ]
        }
      ],
      "id": "sentinel",
      "starting_equipment_text_dump": "listM3PredatorM4ShurikenorM8AvengerOmniBladeOmniHammerMonomolecularBladeorRiotShieldStockLightArmorStockMediumArmororStockHeavyArmorlist"
    },
    {
      "name": "Soldier",
      "hit_die": "1d10",
      "hit_points": "10 + your Constitution modifier",
      "increase_hit_points": "1d10 (or 6) + your Constitution modifier",
      "weapon": "Assault Rifles, Heavy Pistols, Melee, Shotguns, SMGs, and Sniper Rifles",
      "armor_proficiency": "Light, Medium, Heavy",
      "saving_throw": "Strength, Dexterity",
      "skill": "Choose three from Acrobatics, Athletics, History, Intimidation, Medicine, Perception, Persuasion, Stealth, Survival, and Vehicle Handling",
      "primary_ability": "Dexterity",
      "spellcasting": null,
      "d_d_similarities": "Fighter",
      "description": "The Soldier is a tough warrior, able to deal with a range of combat situations. The Soldier gets improved health and has the widest selection of weapons. No one is tougher or more effective at taking down enemies with gunfire.",
      "snippet": "Soldiers are pure combat specialists effective at taking down enemies with gunfire.",
      "starting_equipment": [
        {
          "id": 1,
          "type": "list",
          "data": [
            "Choose 2 from M-3 Predator, M-4 Shuriken, M-8 Avenger, M-92 Mantis, or M-23 Katana",
            "Omni-Blade or Omni-Hammer",
            "Stock Light Armor, Stock Medium Armor, or Stock Heavy Armor"
          ]
        }
      ],
      "id": "soldier",
      "starting_equipment_text_dump": "listChoose2fromM3PredatorM4ShurikenM8AvengerM92MantisorM23KatanaOmniBladeorOmniHammerStockLightArmorStockMediumArmororStockHeavyArmorlist"
    },
    {
      "name": "Vanguard",
      "hit_die": "1d12",
      "hit_points": "12 + your Constitution modifier",
      "increase_hit_points": "1d12 (or 7) + your Constitution modifier",
      "weapon": "Heavy Pistols, Melee, and choose one from Shotguns and SMGs",
      "armor_proficiency": "Light, Medium",
      "saving_throw": "Wisdom, Strength",
      "skill": "Choose three from Acrobatics, Athletics, Deception, Insight, Intimidation, Performance, Persuasion, Sleight of Hand, Survival",
      "primary_ability": "Strength or Wisdom",
      "spellcasting": "Vanguards are outfitted with the L5n biotic implant which draws upon their inner strength of will and focus on their physical mnemonics. As a Vanguard, you use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a biotic spell you cast and when making an attack roll with one.",
      "d_d_similarities": "Paladin/Barbarian",
      "description": "Vanguards are feared for their high-risk high-reward combat style, closing quickly on enemies and destroying them at close range with weapons and biotic abilities. They are outfitted with L5n implants, enabling them to perform a biotic charge that strikes the opponent with incredible force while closing distance.",
      "snippet": "Vanguards have a high-risk high-reward combat style, using biotics and melee strikes.",
      "starting_equipment": [
        {
          "id": 1,
          "type": "list",
          "data": [
            "M-3 Predator, M-4 Shuriken, or M-23 Katana",
            "Omni-Blade, Omni-Hammer, Monomolecular Blade, or Riot Shield",
            "Stock Light Armor or Stock Medium Armor"
          ]
        }
      ],
      "id": "vanguard",
      "starting_equipment_text_dump": "listM3PredatorM4ShurikenorM23KatanaOmniBladeOmniHammerMonomolecularBladeorRiotShieldStockLightArmororStockMediumArmorlist"
    }
  ]
}