{
  "updated": "February 24, 2018 @  2:02 PM",
  "source": "https://docs.google.com/spreadsheets/d/e/2PACX-1vRxNdrcVHvbqyeRuxHkMt2e8GYD92gMn5pTnxNI_1I3s1xC1nACWAgiSimFsgc3GIrcRfhYljjMymyJ/pubhtml",
  "data": [
    {
      "name": "Blinded",
      "mechanic": "Fails checks that require sight. Attack rolls against the creature have advantage. Creature has disadvantage when attacking.",
      "id": "blinded"
    },
    {
      "name": "Charmed",
      "mechanic": "Can't attack the charmer. Charmer has advantage on social ability checks.",
      "id": "charmed"
    },
    {
      "name": "Deafened",
      "mechanic": "Fails checks that require sound.",
      "id": "deafened"
    },
    {
      "name": "Frightened",
      "mechanic": "Disadvantage on ability checks and attack rolls against the source of its fear. Can't willingly moved closer to the source of its fear.",
      "id": "frightened"
    },
    {
      "name": "Frozen",
      "mechanic": "Incapacitated. Attack rolls against the creature have advantage. Automatically fails Dexterity saving throws.",
      "id": "frozen"
    },
    {
      "name": "Grappled",
      "mechanic": "Speed becomes 0. Ends if grappler becomes incapacitated or an effect removes the grappler beyond melee range of the creature.",
      "id": "grappled"
    },
    {
      "name": "Incapacitated",
      "mechanic": "Can't take actions or reactions.",
      "id": "incapacitated"
    },
    {
      "name": "Invisible",
      "mechanic": "Impossible to see without special gadgets. The creature still makes noise and tracks. Attack rolls against the creature have disadvantage. The creature has advantage on attack rolls.",
      "id": "invisible"
    },
    {
      "name": "Lifted",
      "mechanic": "Restrained. Primed (force). A detonating attack ends the lifted condition. A lifted target has no mass and is dangled in the air by a temporary mass effect field. Thus, a lifted creature can be pushed, pulled, or otherwise manipulated for varying results.",
      "id": "lifted"
    },
    {
      "name": "Paralyzed",
      "mechanic": "Incapacitated. Attack rolls against the creature have advantage. Automatically fails Strength and Dexterity saving throws. Any attack that hits made within melee range (2m) is a critical hit.\"",
      "id": "paralyzed"
    },
    {
      "name": "Petrified",
      "mechanic": "Incapacitated. Attack rolls against the creature have advantage. Automatically fails Strength and Dexterity saving throws. Resistance to all damage. Immune to poison and disease.",
      "id": "petrified"
    },
    {
      "name": "Poisoned",
      "mechanic": "Disadvantage on attack rolls and ability checks.",
      "id": "poisoned"
    },
    {
      "name": "Primed",
      "mechanic": "Subject to a detonating attack or spell, triggering a powerful effect. Creatures can be primed with one of the following damage types: Force, Necrotic, Fire, Cold, or Lightning. The resulting effect is dependant on the priming damage type. See Spellcasting Rules for more information.",
      "id": "primed"
    },
    {
      "name": "Prone",
      "mechanic": "Can crawl. Condition ends if the creature stands up (takes 1/2 movement). Has disadvantage on attack rolls. Attacks against the creature made within 2m have advantage, beyond 2m disadvantage.",
      "id": "prone"
    },
    {
      "name": "Restrained",
      "mechanic": "Speed becomes 0. Attack rolls have disadvantage. Attack rolls against the creature have advantage. Disadvantage on Dexterity saving throws.",
      "id": "restrained"
    },
    {
      "name": "Stunned",
      "mechanic": "Incapacitated. Automatically fails Strength and Dexterity saving throws. Attack rolls against the creature have advantage.",
      "id": "stunned"
    },
    {
      "name": "Targeting",
      "mechanic": "Speed is reduced by half. Automatically fail Dexterity saving throws. Creatures that attack the creature have advantage.",
      "id": "targeting"
    },
    {
      "name": "Unconscious",
      "mechanic": "Incapacitated. Drops any weapons. Fails Strength and Dexterity saving throws. Attack rolls against the creature have advantage. Any attack within 2m that hits is a critical hit.",
      "id": "unconscious"
    },
    {
      "name": "Unprotected",
      "mechanic": "Has no shield points or barrier ticks.",
      "id": "unprotected"
    }
  ]
}