{
  "abilityScores": {
    "str": 30,
    "dex": 11,
    "con": 30,
    "int": 3,
    "wis": 11,
    "cha": 11
  },
  "ac": "22",
  "actions": [
    {
      "type": "standard",
      "name": "Multiattack",
      "description": "The thresher maw can use its Frightful Presence. It then makes four attacks: one with its grasp, two with its tail, one with its acid spit. It can use its Swallow instead of its grasp."
    },
    {
      "type": "ranged",
      "name": "Acid Spit",
      "range": 60,
      "target": "one target",
      "hit": "The thresher maw targets a 6m radius within 60m and launches a glob of acid that coats the area. Each creature within the area must succeed on a DC 22 Dexterity saving throw, taking 44 (8d10) acid damage on a failed save, or half as much on a successful one. Until the end of the thresher maw's next turn, each creature that enters the area or ends its turn there must also make the saving throw.",
      "miss": null,
      "attackMod": 7
    },
    {
      "type": "melee",
      "name": "Grasp",
      "range": 4,
      "target": "one target",
      "hit": "29 (3d12 + 10) bludgeoning damage and 13 (2d12) acid damage. If the target is a creature, it is grappled (escape DC 22). Until this grapple ends, the target is restrained, and the thresher maw can't grasp another target.",
      "miss": null,
      "attackMod": 17
    },
    {
      "type": "standard",
      "name": "Swallow",
      "recharge": null,
      "description": "The thresher maw makes one grasp attack against a Large or smaller creature it is grappling. If the attack hits, the target takes the grasp's damage, the target is swallowed, and the grapple ends. While swallowed, the creature is blinded and restrained, it has total cover against attacks and other effects outside the thresher maw, and it takes 56 (16d6) acid damage at the start of each of the thresher maw's turns.\n--If the thresher maw takes 60 damage or more on a single turn from a creature inside it, the thresher maw must succeed on a DC 20 Constitution saving throw at the end of that turn or regurgitate all swallowed creatures, which fall prone in a space within 4m of the thresher maw. If the thresher maw dies, a swallowed creature is no longer restrained by it and can escape from the corpse by using 12m of movement, exiting prone."
    },
    {
      "type": "melee",
      "name": "Tail",
      "range": 8,
      "target": "one target",
      "hit": "24 (4d6 + 10) bludgeoning damage. If the target is a creature, it must succeed on a DC 22 Strength saving throw or be knocked prone.",
      "miss": null,
      "attackMod": 17
    }
  ],
  "alignment": "Unaligned",
  "barrier": null,
  "conditionImmunities": [
    "charmed",
    "frightened",
    "paralyzed",
    "frozen",
    "lifted"
  ],
  "cr": "28",
  "damageImmunities": [],
  "damageResistances": [
    "acid",
    "bludgeoning",
    "cold",
    "fire",
    "force",
    "lightning",
    "piercing",
    "poison",
    "slashing"
  ],
  "damageVulnerabilities": [],
  "features": [
    {
      "name": "Destroy Terrain",
      "recharge": null,
      "description": "When the thresher maw moves via burrowing, the ground it moves through becomes difficult terrain."
    },
    {
      "name": "Frightful Presence",
      "recharge": null,
      "description": "Each creature of the thresher maw's choice that is within 60m of the name and aware of it must succeed on a DC 22 Wisdom saving throw or become {frightened} for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the thresher maw's Frightful Presence for the next 24 hours."
    },
    {
      "name": "Legendary Resistance",
      "recharge": "3/Day",
      "description": "If the thresher maw fails a saving throw, it can choose to succeed instead."
    },
    {
      "name": "Siege Monster",
      "recharge": null,
      "description": "The thresher maw deals double damage to objects and structures."
    }
  ],
  "hp": {
    "numDice": 27,
    "die": 20
  },
  "id": "thresher_maw",
  "image": "https://vignette.wikia.nocookie.net/masseffect/images/9/9e/Thresher_Maw_ME2.png/revision/latest?cb=20100704014552",
  "lairActions": [],
  "legendaryActions": [
    {
      "name": "Acid Spit Attack",
      "cost": 2,
      "description": "The thresher maw makes an acid spit attack."
    },
    {
      "name": "Move",
      "cost": 1,
      "description": "The thresher maw moves up to half its speed."
    },
    {
      "name": "Tail Attack",
      "cost": 1,
      "description": "The thresher maw makes a tail attack."
    }
  ],
  "name": "Thresher Maw",
  "profBonus": 8,
  "reactions": [],
  "savingThrows": [
    "str",
    "con"
  ],
  "senses": [
    {
      "sense": "blindsight",
      "range": 10
    },
    {
      "sense": "tremorsense",
      "range": 20
    }
  ],
  "size": "Gargantuan",
  "skills": [],
  "speed": [
    {
      "type": "walk",
      "range": 20
    },
    {
      "type": "burrow",
      "range": 12
    }
  ],
  "spellcasting": false,
  "type": "Organic",
  "unit": "Alien"
}